;******************************************************************************
;* TI ARM C/C++ Codegen                                           Unix v5.2.5 *
;* Date/Time created: Fri May 13 14:57:25 2016                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disable_dual_state --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../utils/ff.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v5.2.5 Copyright (c) 1996-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/Users/thomas/Dropbox/Masterthesis/code/CCStudio_workspace/MSP432_DisplacementLogger_V1/Optimized")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("get_fattime")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("get_fattime")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$1, DW_AT_decl_column(0x07)

$C$DW$2	.dwtag  DW_TAG_subprogram, DW_AT_name("disk_initialize")

	.dwattr $C$DW$754, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$754, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$754, DW_AT_decl_column(0x02)
$C$DW$755	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_INT_ERR"), DW_AT_const_value(0x02)
	.dwattr $C$DW$755, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$755, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$755, DW_AT_decl_column(0x02)
$C$DW$756	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_READY"), DW_AT_const_value(0x03)
	.dwattr $C$DW$756, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$756, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$756, DW_AT_decl_column(0x02)
$C$DW$757	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_NO_FILE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$757, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$757, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$757, DW_AT_decl_column(0x02)
$C$DW$758	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_NO_PATH"), DW_AT_const_value(0x05)
	.dwattr $C$DW$758, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$758, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$758, DW_AT_decl_column(0x02)
$C$DW$759	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_NAME"), DW_AT_const_value(0x06)
	.dwattr $C$DW$759, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$759, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$759, DW_AT_decl_column(0x02)
$C$DW$760	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_DENIED"), DW_AT_const_value(0x07)
	.dwattr $C$DW$760, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$760, DW_AT_decl_line(0xba)
	.dwattr $C$DW$760, DW_AT_decl_column(0x02)
$C$DW$761	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_EXIST"), DW_AT_const_value(0x08)
	.dwattr $C$DW$761, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$761, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$761, DW_AT_decl_column(0x02)
$C$DW$762	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_OBJECT"), DW_AT_const_value(0x09)
	.dwattr $C$DW$762, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$762, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$762, DW_AT_decl_column(0x02)
$C$DW$763	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_WRITE_PROTECTED"), DW_AT_const_value(0x0a)
	.dwattr $C$DW$763, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$763, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$763, DW_AT_decl_column(0x02)
$C$DW$764	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_DRIVE"), DW_AT_const_value(0x0b)
	.dwattr $C$DW$764, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$764, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$764, DW_AT_decl_column(0x02)
$C$DW$765	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENABLED"), DW_AT_const_value(0x0c)
	.dwattr $C$DW$765, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$765, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$765, DW_AT_decl_column(0x02)
$C$DW$766	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_NO_FILESYSTEM"), DW_AT_const_value(0x0d)
	.dwattr $C$DW$766, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$766, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$766, DW_AT_decl_column(0x02)
$C$DW$767	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_MKFS_ABORTED"), DW_AT_const_value(0x0e)
	.dwattr $C$DW$767, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$767, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$767, DW_AT_decl_column(0x02)
$C$DW$768	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_TIMEOUT"), DW_AT_const_value(0x0f)
	.dwattr $C$DW$768, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$768, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$768, DW_AT_decl_column(0x02)
$C$DW$769	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_LOCKED"), DW_AT_const_value(0x10)
	.dwattr $C$DW$769, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$769, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$769, DW_AT_decl_column(0x02)
$C$DW$770	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENOUGH_CORE"), DW_AT_const_value(0x11)
	.dwattr $C$DW$770, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$770, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$770, DW_AT_decl_column(0x02)
$C$DW$771	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_TOO_MANY_OPEN_FILES"), DW_AT_const_value(0x12)
	.dwattr $C$DW$771, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$771, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$771, DW_AT_decl_column(0x02)
$C$DW$772	.dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_PARAMETER"), DW_AT_const_value(0x13)
	.dwattr $C$DW$772, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$772, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$772, DW_AT_decl_column(0x02)
	.dwendtag $C$DW$T$52

	.dwattr $C$DW$T$52, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x0e)
$C$DW$T$53	.dwtag  DW_TAG_typedef, DW_AT_name("FRESULT")
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$53, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x03)

$C$DW$T$127	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$127, DW_AT_byte_size(0x01)
$C$DW$773	.dwtag  DW_TAG_enumerator, DW_AT_name("FALSE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$773, DW_AT_decl_file("../utils/integer.h")
	.dwattr $C$DW$773, DW_AT_decl_line(0x24)
	.dwattr $C$DW$773, DW_AT_decl_column(0x10)
$C$DW$774	.dwtag  DW_TAG_enumerator, DW_AT_name("TRUE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$774, DW_AT_decl_file("../utils/integer.h")
	.dwattr $C$DW$774, DW_AT_decl_line(0x24)
	.dwattr $C$DW$774, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$127

	.dwattr $C$DW$T$127, DW_AT_decl_file("../utils/integer.h")
	.dwattr $C$DW$T$127, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$127, DW_AT_decl_column(0x0e)
$C$DW$T$128	.dwtag  DW_TAG_typedef, DW_AT_name("BOOL")
	.dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
	.dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$128, DW_AT_decl_file("../utils/integer.h")
	.dwattr $C$DW$T$128, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$128, DW_AT_decl_column(0x22)

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x234)
$C$DW$775	.dwtag  DW_TAG_member
	.dwattr $C$DW$775, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$775, DW_AT_name("fs_type")
	.dwattr $C$DW$775, DW_AT_TI_symbol_name("fs_type")
	.dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$775, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$775, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$775, DW_AT_decl_column(0x07)
$C$DW$776	.dwtag  DW_TAG_member
	.dwattr $C$DW$776, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$776, DW_AT_name("drv")
	.dwattr $C$DW$776, DW_AT_TI_symbol_name("drv")
	.dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$776, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$776, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$776, DW_AT_decl_column(0x07)
$C$DW$777	.dwtag  DW_TAG_member
	.dwattr $C$DW$777, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$777, DW_AT_name("csize")
	.dwattr $C$DW$777, DW_AT_TI_symbol_name("csize")
	.dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$777, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$777, DW_AT_decl_line(0x50)
	.dwattr $C$DW$777, DW_AT_decl_column(0x07)
$C$DW$778	.dwtag  DW_TAG_member
	.dwattr $C$DW$778, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$778, DW_AT_name("n_fats")
	.dwattr $C$DW$778, DW_AT_TI_symbol_name("n_fats")
	.dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$778, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$778, DW_AT_decl_line(0x51)
	.dwattr $C$DW$778, DW_AT_decl_column(0x07)
$C$DW$779	.dwtag  DW_TAG_member
	.dwattr $C$DW$779, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$779, DW_AT_name("wflag")
	.dwattr $C$DW$779, DW_AT_TI_symbol_name("wflag")
	.dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$779, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$779, DW_AT_decl_line(0x52)
	.dwattr $C$DW$779, DW_AT_decl_column(0x07)
$C$DW$780	.dwtag  DW_TAG_member
	.dwattr $C$DW$780, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$780, DW_AT_name("fsi_flag")
	.dwattr $C$DW$780, DW_AT_TI_symbol_name("fsi_flag")
	.dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$780, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$780, DW_AT_decl_line(0x53)
	.dwattr $C$DW$780, DW_AT_decl_column(0x07)
$C$DW$781	.dwtag  DW_TAG_member
	.dwattr $C$DW$781, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$781, DW_AT_name("id")
	.dwattr $C$DW$781, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$781, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$781, DW_AT_decl_line(0x54)
	.dwattr $C$DW$781, DW_AT_decl_column(0x07)
$C$DW$782	.dwtag  DW_TAG_member
	.dwattr $C$DW$782, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$782, DW_AT_name("n_rootdir")
	.dwattr $C$DW$782, DW_AT_TI_symbol_name("n_rootdir")
	.dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$782, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$782, DW_AT_decl_line(0x55)
	.dwattr $C$DW$782, DW_AT_decl_column(0x07)
$C$DW$783	.dwtag  DW_TAG_member
	.dwattr $C$DW$783, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$783, DW_AT_name("last_clust")
	.dwattr $C$DW$783, DW_AT_TI_symbol_name("last_clust")
	.dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$783, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$783, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$783, DW_AT_decl_column(0x08)
$C$DW$784	.dwtag  DW_TAG_member
	.dwattr $C$DW$784, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$784, DW_AT_name("free_clust")
	.dwattr $C$DW$784, DW_AT_TI_symbol_name("free_clust")
	.dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$784, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$784, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$784, DW_AT_decl_column(0x08)
$C$DW$785	.dwtag  DW_TAG_member
	.dwattr $C$DW$785, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$785, DW_AT_name("fsi_sector")
	.dwattr $C$DW$785, DW_AT_TI_symbol_name("fsi_sector")
	.dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$785, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$785, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$785, DW_AT_decl_column(0x08)
$C$DW$786	.dwtag  DW_TAG_member
	.dwattr $C$DW$786, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$786, DW_AT_name("n_fatent")
	.dwattr $C$DW$786, DW_AT_TI_symbol_name("n_fatent")
	.dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$786, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$786, DW_AT_decl_line(0x64)
	.dwattr $C$DW$786, DW_AT_decl_column(0x08)
$C$DW$787	.dwtag  DW_TAG_member
	.dwattr $C$DW$787, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$787, DW_AT_name("fsize")
	.dwattr $C$DW$787, DW_AT_TI_symbol_name("fsize")
	.dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$787, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$787, DW_AT_decl_line(0x65)
	.dwattr $C$DW$787, DW_AT_decl_column(0x08)
$C$DW$788	.dwtag  DW_TAG_member
	.dwattr $C$DW$788, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$788, DW_AT_name("volbase")
	.dwattr $C$DW$788, DW_AT_TI_symbol_name("volbase")
	.dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$788, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$788, DW_AT_decl_line(0x66)
	.dwattr $C$DW$788, DW_AT_decl_column(0x08)
$C$DW$789	.dwtag  DW_TAG_member
	.dwattr $C$DW$789, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$789, DW_AT_name("fatbase")
	.dwattr $C$DW$789, DW_AT_TI_symbol_name("fatbase")
	.dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$789, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$789, DW_AT_decl_line(0x67)
	.dwattr $C$DW$789, DW_AT_decl_column(0x08)
$C$DW$790	.dwtag  DW_TAG_member
	.dwattr $C$DW$790, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$790, DW_AT_name("dirbase")
	.dwattr $C$DW$790, DW_AT_TI_symbol_name("dirbase")
	.dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$790, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$790, DW_AT_decl_line(0x68)
	.dwattr $C$DW$790, DW_AT_decl_column(0x08)
$C$DW$791	.dwtag  DW_TAG_member
	.dwattr $C$DW$791, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$791, DW_AT_name("database")
	.dwattr $C$DW$791, DW_AT_TI_symbol_name("database")
	.dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$791, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$791, DW_AT_decl_line(0x69)
	.dwattr $C$DW$791, DW_AT_decl_column(0x08)
$C$DW$792	.dwtag  DW_TAG_member
	.dwattr $C$DW$792, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$792, DW_AT_name("winsect")
	.dwattr $C$DW$792, DW_AT_TI_symbol_name("winsect")
	.dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$792, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$792, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$792, DW_AT_decl_column(0x08)
$C$DW$793	.dwtag  DW_TAG_member
	.dwattr $C$DW$793, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$793, DW_AT_name("win")
	.dwattr $C$DW$793, DW_AT_TI_symbol_name("win")
	.dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$793, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$793, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$793, DW_AT_decl_column(0x07)
	.dwendtag $C$DW$T$23

	.dwattr $C$DW$T$23, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
$C$DW$T$24	.dwtag  DW_TAG_typedef, DW_AT_name("FATFS")
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$24, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x03)
$C$DW$T$25	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$25, DW_AT_address_class(0x20)
$C$DW$T$69	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$69, DW_AT_address_class(0x20)
$C$DW$T$129	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$69)

$C$DW$T$130	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$130, DW_AT_byte_size(0x04)
$C$DW$794	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$794, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$130

$C$DW$T$131	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$25)
$C$DW$T$33	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$33, DW_AT_address_class(0x20)

$C$DW$T$34	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x04)
$C$DW$795	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$795, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$34


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x1c)
$C$DW$796	.dwtag  DW_TAG_member
	.dwattr $C$DW$796, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$796, DW_AT_name("fs")
	.dwattr $C$DW$796, DW_AT_TI_symbol_name("fs")
	.dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$796, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$796, DW_AT_decl_line(0x90)
	.dwattr $C$DW$796, DW_AT_decl_column(0x09)
$C$DW$797	.dwtag  DW_TAG_member
	.dwattr $C$DW$797, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$797, DW_AT_name("id")
	.dwattr $C$DW$797, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$797, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$797, DW_AT_decl_line(0x91)
	.dwattr $C$DW$797, DW_AT_decl_column(0x07)
$C$DW$798	.dwtag  DW_TAG_member
	.dwattr $C$DW$798, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$798, DW_AT_name("index")
	.dwattr $C$DW$798, DW_AT_TI_symbol_name("index")
	.dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$798, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$798, DW_AT_decl_line(0x92)
	.dwattr $C$DW$798, DW_AT_decl_column(0x07)
$C$DW$799	.dwtag  DW_TAG_member
	.dwattr $C$DW$799, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$799, DW_AT_name("sclust")
	.dwattr $C$DW$799, DW_AT_TI_symbol_name("sclust")
	.dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$799, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$799, DW_AT_decl_line(0x93)
	.dwattr $C$DW$799, DW_AT_decl_column(0x08)
$C$DW$800	.dwtag  DW_TAG_member
	.dwattr $C$DW$800, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$800, DW_AT_name("clust")
	.dwattr $C$DW$800, DW_AT_TI_symbol_name("clust")
	.dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$800, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$800, DW_AT_decl_line(0x94)
	.dwattr $C$DW$800, DW_AT_decl_column(0x08)
$C$DW$801	.dwtag  DW_TAG_member
	.dwattr $C$DW$801, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$801, DW_AT_name("sect")
	.dwattr $C$DW$801, DW_AT_TI_symbol_name("sect")
	.dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$801, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$801, DW_AT_decl_line(0x95)
	.dwattr $C$DW$801, DW_AT_decl_column(0x08)
$C$DW$802	.dwtag  DW_TAG_member
	.dwattr $C$DW$802, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$802, DW_AT_name("dir")
	.dwattr $C$DW$802, DW_AT_TI_symbol_name("dir")
	.dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$802, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$802, DW_AT_decl_line(0x96)
	.dwattr $C$DW$802, DW_AT_decl_column(0x08)
$C$DW$803	.dwtag  DW_TAG_member
	.dwattr $C$DW$803, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$803, DW_AT_name("fn")
	.dwattr $C$DW$803, DW_AT_TI_symbol_name("fn")
	.dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$803, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$803, DW_AT_decl_line(0x97)
	.dwattr $C$DW$803, DW_AT_decl_column(0x08)
	.dwendtag $C$DW$T$27

	.dwattr $C$DW$T$27, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
$C$DW$T$57	.dwtag  DW_TAG_typedef, DW_AT_name("DIR")
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$57, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x03)
$C$DW$T$58	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$58, DW_AT_address_class(0x20)
$C$DW$T$136	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$58)

$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x18)
$C$DW$804	.dwtag  DW_TAG_member
	.dwattr $C$DW$804, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$804, DW_AT_name("fsize")
	.dwattr $C$DW$804, DW_AT_TI_symbol_name("fsize")
	.dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$804, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$804, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$804, DW_AT_decl_column(0x08)
$C$DW$805	.dwtag  DW_TAG_member
	.dwattr $C$DW$805, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$805, DW_AT_name("fdate")
	.dwattr $C$DW$805, DW_AT_TI_symbol_name("fdate")
	.dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$805, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$805, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$805, DW_AT_decl_column(0x07)
$C$DW$806	.dwtag  DW_TAG_member
	.dwattr $C$DW$806, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$806, DW_AT_name("ftime")
	.dwattr $C$DW$806, DW_AT_TI_symbol_name("ftime")
	.dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$806, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$806, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$806, DW_AT_decl_column(0x07)
$C$DW$807	.dwtag  DW_TAG_member
	.dwattr $C$DW$807, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$807, DW_AT_name("fattrib")
	.dwattr $C$DW$807, DW_AT_TI_symbol_name("fattrib")
	.dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$807, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$807, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$807, DW_AT_decl_column(0x07)
$C$DW$808	.dwtag  DW_TAG_member
	.dwattr $C$DW$808, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$808, DW_AT_name("fname")
	.dwattr $C$DW$808, DW_AT_TI_symbol_name("fname")
	.dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$808, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$808, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$808, DW_AT_decl_column(0x08)
	.dwendtag $C$DW$T$31

	.dwattr $C$DW$T$31, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
$C$DW$T$83	.dwtag  DW_TAG_typedef, DW_AT_name("FILINFO")
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$83, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$T$83, DW_AT_decl_line(0xac)
	.dwattr $C$DW$T$83, DW_AT_decl_column(0x03)
$C$DW$T$91	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$83)
$C$DW$T$92	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$T$92, DW_AT_address_class(0x20)
$C$DW$T$142	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$92)
$C$DW$T$84	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$T$84, DW_AT_address_class(0x20)
$C$DW$T$143	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$84)

$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x224)
$C$DW$809	.dwtag  DW_TAG_member
	.dwattr $C$DW$809, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$809, DW_AT_name("fs")
	.dwattr $C$DW$809, DW_AT_TI_symbol_name("fs")
	.dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$809, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$809, DW_AT_decl_line(0x73)
	.dwattr $C$DW$809, DW_AT_decl_column(0x09)
$C$DW$810	.dwtag  DW_TAG_member
	.dwattr $C$DW$810, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$810, DW_AT_name("id")
	.dwattr $C$DW$810, DW_AT_TI_symbol_name("id")
	.dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$810, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$810, DW_AT_decl_line(0x74)
	.dwattr $C$DW$810, DW_AT_decl_column(0x07)
$C$DW$811	.dwtag  DW_TAG_member
	.dwattr $C$DW$811, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$811, DW_AT_name("flag")
	.dwattr $C$DW$811, DW_AT_TI_symbol_name("flag")
	.dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$811, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$811, DW_AT_decl_line(0x75)
	.dwattr $C$DW$811, DW_AT_decl_column(0x07)
$C$DW$812	.dwtag  DW_TAG_member
	.dwattr $C$DW$812, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$812, DW_AT_name("pad1")
	.dwattr $C$DW$812, DW_AT_TI_symbol_name("pad1")
	.dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$812, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$812, DW_AT_decl_line(0x76)
	.dwattr $C$DW$812, DW_AT_decl_column(0x07)
$C$DW$813	.dwtag  DW_TAG_member
	.dwattr $C$DW$813, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$813, DW_AT_name("fptr")
	.dwattr $C$DW$813, DW_AT_TI_symbol_name("fptr")
	.dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$813, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$813, DW_AT_decl_line(0x77)
	.dwattr $C$DW$813, DW_AT_decl_column(0x08)
$C$DW$814	.dwtag  DW_TAG_member
	.dwattr $C$DW$814, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$814, DW_AT_name("fsize")
	.dwattr $C$DW$814, DW_AT_TI_symbol_name("fsize")
	.dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$814, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$814, DW_AT_decl_line(0x78)
	.dwattr $C$DW$814, DW_AT_decl_column(0x08)
$C$DW$815	.dwtag  DW_TAG_member
	.dwattr $C$DW$815, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$815, DW_AT_name("sclust")
	.dwattr $C$DW$815, DW_AT_TI_symbol_name("sclust")
	.dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$815, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$815, DW_AT_decl_line(0x79)
	.dwattr $C$DW$815, DW_AT_decl_column(0x08)
$C$DW$816	.dwtag  DW_TAG_member
	.dwattr $C$DW$816, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$816, DW_AT_name("clust")
	.dwattr $C$DW$816, DW_AT_TI_symbol_name("clust")
	.dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$816, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$816, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$816, DW_AT_decl_column(0x08)
$C$DW$817	.dwtag  DW_TAG_member
	.dwattr $C$DW$817, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$817, DW_AT_name("dsect")
	.dwattr $C$DW$817, DW_AT_TI_symbol_name("dsect")
	.dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$817, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$817, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$817, DW_AT_decl_column(0x08)
$C$DW$818	.dwtag  DW_TAG_member
	.dwattr $C$DW$818, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$818, DW_AT_name("dir_sect")
	.dwattr $C$DW$818, DW_AT_TI_symbol_name("dir_sect")
	.dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$818, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$818, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$818, DW_AT_decl_column(0x08)
$C$DW$819	.dwtag  DW_TAG_member
	.dwattr $C$DW$819, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$819, DW_AT_name("dir_ptr")
	.dwattr $C$DW$819, DW_AT_TI_symbol_name("dir_ptr")
	.dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$819, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$819, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$819, DW_AT_decl_column(0x08)
$C$DW$820	.dwtag  DW_TAG_member
	.dwattr $C$DW$820, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$820, DW_AT_name("buf")
	.dwattr $C$DW$820, DW_AT_TI_symbol_name("buf")
	.dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$820, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$820, DW_AT_decl_line(0x87)
	.dwattr $C$DW$820, DW_AT_decl_column(0x07)
	.dwendtag $C$DW$T$32

	.dwattr $C$DW$T$32, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x72)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
$C$DW$T$73	.dwtag  DW_TAG_typedef, DW_AT_name("FIL")
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$73, DW_AT_decl_file("../utils/ff.h")
	.dwattr $C$DW$T$73, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
$C$DW$T$74	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$T$74, DW_AT_address_class(0x20)
$C$DW$T$146	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$74)

$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_name(".ggroup1")
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x08)
$C$DW$821	.dwtag  DW_TAG_member
	.dwattr $C$DW$821, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$821, DW_AT_name("Fsid")
	.dwattr $C$DW$821, DW_AT_TI_symbol_name("Fsid")
	.dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$822	.dwtag  DW_TAG_member
	.dwattr $C$DW$822, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$822, DW_AT_name("FatFs")
	.dwattr $C$DW$822, DW_AT_TI_symbol_name("FatFs")
	.dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$35


$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_name(".ggroup2")
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x2c)
$C$DW$823	.dwtag  DW_TAG_member
	.dwattr $C$DW$823, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$823, DW_AT_name("vst")
	.dwattr $C$DW$823, DW_AT_TI_symbol_name("vst$1")
	.dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$824	.dwtag  DW_TAG_member
	.dwattr $C$DW$824, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$824, DW_AT_name("cst")
	.dwattr $C$DW$824, DW_AT_TI_symbol_name("cst$2")
	.dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$38

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)
$C$DW$T$78	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$2)
$C$DW$T$79	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$79, DW_AT_address_class(0x20)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("BYTE")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$19, DW_AT_decl_file("../utils/integer.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x16)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x17)
$C$DW$T$42	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$19)
$C$DW$T$43	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$43, DW_AT_address_class(0x20)
$C$DW$T$158	.dwtag  DW_TAG_typedef, DW_AT_name("DSTATUS")
	.dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$158, DW_AT_decl_file("../utils/diskio.h")
	.dwattr $C$DW$T$158, DW_AT_decl_line(0x13)
	.dwattr $C$DW$T$158, DW_AT_decl_column(0x0e)

$C$DW$T$22	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x200)
$C$DW$825	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$825, DW_AT_upper_bound(0x1ff)
	.dwendtag $C$DW$T$22

$C$DW$T$26	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$26, DW_AT_address_class(0x20)

$C$DW$T$161	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$161, DW_AT_byte_size(0x0c)
$C$DW$826	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$826, DW_AT_upper_bound(0x0b)
	.dwendtag $C$DW$T$161


$C$DW$T$162	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$162, DW_AT_byte_size(0x15)
$C$DW$827	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$827, DW_AT_upper_bound(0x14)
	.dwendtag $C$DW$T$162

$C$DW$T$163	.dwtag  DW_TAG_typedef, DW_AT_name("UCHAR")
	.dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$163, DW_AT_decl_file("../utils/integer.h")
	.dwattr $C$DW$T$163, DW_AT_decl_line(0x15)
	.dwattr $C$DW$T$163, DW_AT_decl_column(0x17)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
$C$DW$T$183	.dwtag  DW_TAG_typedef, DW_AT_name("SHORT")
	.dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$183, DW_AT_decl_file("../utils/integer.h")
	.dwattr $C$DW$T$183, DW_AT_decl_line(0x19)
	.dwattr $C$DW$T$183, DW_AT_decl_column(0x11)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
